# 3. დაწერეთ პითონის პროგრამა, რომელიც მიიღებს ტელეფონის ნომერს და 
#    regex-ით შეამოწმებს შეყვანილი ნომერი იცავს თუ არა "(123) 456-789" ფორმატს, 
#    თუ იცავს დააბრუნეთ შეყნვაილი ტელეფონის ნომერი, 
#    წინააღმდეგ შემთხვევაში გამოიტანეთ "Invalid format" ტექსტი.

# მინიშნება: სრული დამთხვევისთვის გამოიყენეთ .fullmatch() მეთოდი re მოდულიდან

import re

phone = "(123) 456-789"

phone_pattern = r"^\(\d{3}\)\s\d{3}-\d{3}$"

if re.fullmatch(phone_pattern,phone):
    print(phone)
else:
    print("Invalid format")
